In [2]:
#import pandas and label it as 'pd' "as alias"
import pandas as pd

In [3]:
train=pd.read_csv('titanic_train.csv')
test=pd.read_csv('titanic_test.csv')

In [4]:
type(train)

pandas.core.frame.DataFrame

In [5]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
train.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [7]:
train.shape

(891, 12)

In [26]:
#number entries
test_scores=pd.DataFrame({'Student ID':[154,973,645],'Science':[50,59,48],'geography':[88,68,87],
                          'math':[68,89,96]})
test_scores

   Student ID  Science  geography  math
0         154       50         88    68
1         973       59         68    89
2         645       48         87    96

In [27]:
#Text entries
survey=pd.DataFrame({'james':['I like it','It could use a bit more salt'],'Emity':['It is too sweet','Yam!']})
survey

                          james            Emity
0                     I like it  It is too sweet
1  It could use a bit more salt             Yam!

In [28]:
test_scores=test_scores.set_index('Student ID')
test_scores

            Science  geography  math
Student ID
154              50         88    68
973              59         68    89
645              48         87    96

In [29]:
survey = pd.DataFrame({'James': ['I liked it', 'It could use a bit more salt'], 'Emily': ['It is too sweet', 'Yum!']},
                     index = ['Product A', 'Product B'])
survey

                                  James            Emily
Product A                    I liked it  It is too sweet
Product B  It could use a bit more salt             Yum!

In [12]:
survey.reset_index(drop=True,inplace=True)

In [13]:
survey

                          James            Emily
0                    I liked it  It is too sweet
1  It could use a bit more salt             Yum!

In [30]:
test_scores.rename(columns={'geography':'Physics','Science':'Arts'},inplace=True)
test_scores

            Arts  Physics  math
Student ID
154           50       88    68
973           59       68    89
645           48       87    96

In [31]:
test_scores.drop(columns='math',inplace=True)
test_scores

            Arts  Physics
Student ID
154           50       88
973           59       68
645           48       87

In [32]:
test_scores.drop(645,inplace=True)
test_scores

            Arts  Physics
Student ID
154           50       88
973           59       68

In [33]:
test_scores

            Arts  Physics
Student ID
154           50       88
973           59       68

In [24]:
test_scores['History']=[79,70]
test_scores

            Arts  Physics  History
Student ID
154           50       88       79
645           48       87       70

In [25]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [28]:
profit=pd.Series([78,98,65],index=['2018 profit','2019 profit','2020 profit'])
profit

2018 profit    78
2019 profit    98
2020 profit    65
dtype: int64

In [29]:
customer_sales=pd.DataFrame([[317,'Melbourne', 80],[887,'New York', 91],[225,'London',50]],columns=['customer_ID','City','Sales'])
customer_sales

   customer_ID       City  Sales
0          317  Melbourne     80
1          887   New York     91
2          225     London     50